[
  {
    "id": 1,
    "full_name": "George Washington",
    "birth_year": 1732,
    "death_year": 1799,
    "took_office": "1789-04-30",
    "left_office": "1797-03-04",
    "party": "No Party",
    "image_name": "US_President_L_1",
    "biography": "George Washington (February 22, 1732 – December 14, 1799) was an American political leader, military general, statesman, and Founding Father who served as the first president of the United States from 1789 to 1797. Previously, he led Patriot forces to victory in the nation's War for Independence. He presided at the Constitutional Convention of 1787 which established the U.S. Constitution and a federal government. Washington has been called the 'Father of His Country' for his manifold leadership in the formative days of the new nation.",
    "website": "https://en.wikipedia.org/wiki/George_Washington"
  },
  {
    "id": 2,
    "full_name": "John Adams",
    "birth_year": 1735,
    "death_year": 1826,
    "took_office": "1797-03-04",
    "left_office": "1801-03-04",
    "party": "Federalist",
    "image_name": "US_President_L_2",
    "biography": "John Adams Jr. (October 30, 1735 – July 4, 1826) was an American statesman, attorney, diplomat, writer, and Founding Father who served as the second president of the United States from 1797 to 1801. Before his presidency, he was a leader of the American Revolution that achieved independence from Great Britain and served as the first vice president of the United States. Adams was a dedicated diarist and regularly corresponded with many important figures in early American history, including his wife and adviser, Abigail. His letters and other papers serve as an important source of historical information about the era.",
    "website": "https://en.wikipedia.org/wiki/John_Adams"
  },
  {
    "id": 3,
    "full_name": "Thomas Jefferson",
    "birth_year": 1743,
    "death_year": 1826,
    "took_office": "1801-03-04",
    "left_office": "1809-03-04",
    "party": "Democratic-Republican",
    "image_name": "US_President_L_3",
    "biography": "Thomas Jefferson (April 13, 1743 – July 4, 1826) was an American statesman, diplomat, lawyer, architect, and Founding Father who served as the third president of the United States from 1801 to 1809. Previously, he had served as the second vice president of the United States from 1797 to 1801. The principal author of the Declaration of Independence, Jefferson was a proponent of democracy, republicanism, and individual rights, motivating American colonists to break from the Kingdom of Great Britain and form a new nation; he produced formative documents and decisions at both the state and national level.",
    "website": "https://en.wikipedia.org/wiki/Thomas_Jefferson"
  },
  {
    "id": 4,
    "full_name": "James Madison",
    "birth_year": 1751,
    "death_year": 1836,
    "took_office": "1809-03-04",
    "left_office": "1817-03-04",
    "party": "Democratic-Republican",
    "image_name": "US_President_L_4",
    "biography": "James Madison Jr. (March 16, 1751 – June 28, 1836) was an American statesman, lawyer, diplomat, philosopher and Founding Father who served as the fourth president of the United States from 1809 to 1817. He is hailed as the 'Father of the Constitution' for his pivotal role in drafting and promoting the Constitution of the United States and the United States Bill of Rights. He co-wrote The Federalist Papers, co-founded the Democratic-Republican Party, and served as the fifth United States secretary of State from 1801 to 1809.",
    "website": "https://en.wikipedia.org/wiki/James_Madison"
  },
  {
    "id": 5,
    "full_name": "James Monroe",
    "birth_year": 1758,
    "death_year": 1831,
    "took_office": "1817-03-04",
    "left_office": "1825-03-04",
    "party": "Democratic-Republican",
    "image_name": "US_President_L_5",
    "biography": "James Monroe (/mənˈroʊ/; April 28, 1758 – July 4, 1831) was an American statesman, lawyer, diplomat and Founding Father who served as the fifth president of the United States from 1817 to 1825. A member of the Democratic-Republican Party, Monroe was the last president of the Virginia dynasty; his presidency coincided with the Era of Good Feelings. He is perhaps best known for issuing the Monroe Doctrine, a policy of opposing European colonialism in the Americas. He also served as the governor of Virginia, a member of the United States Senate, the U.S. ambassador to France and Britain, the seventh Secretary of State, and the eighth Secretary of War.",
    "website": "https://en.wikipedia.org/wiki/James_Monroe"
  },
  {
    "id": 6,
    "full_name": "John Quincy Adams",
    "birth_year": 1767,
    "death_year": 1848,
    "took_office": "1825-03-04",
    "left_office": "1829-03-04",
    "party": "Democratic-Republican",
    "image_name": "US_President_L_6",
    "biography": "John Quincy Adams (/ˈkwɪnzi/ (About this soundlisten); July 11, 1767 – February 23, 1848) was an American statesman, diplomat, lawyer, and diarist who served as the sixth president of the United States from 1825 to 1829. He previously served as the eighth United States Secretary of State from 1817 to 1825. During his long diplomatic and political career, Adams also served as an ambassador, and represented Massachusetts as a United States Senator and as a member of the United States House of Representatives. He was the eldest son of John Adams, who served as the second US president from 1797 to 1801, and First Lady Abigail Adams. Initially a Federalist like his father, he won election to the presidency as a member of the Democratic-Republican Party, and in the mid-1830s became affiliated with the Whig Party.",
    "website": "https://en.wikipedia.org/wiki/John_Quincy_Adams"
  },
  {
    "id": 7,
    "full_name": "Andrew Jackson",
    "birth_year": 1767,
    "death_year": 1845,
    "took_office": "1829-03-04",
    "left_office": "1837-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_7",
    "biography": "Andrew Jackson (March 15, 1767 – June 8, 1845) was an American soldier and statesman who served as the seventh president of the United States from 1829 to 1837. Before being elected to the presidency, Jackson gained fame as a general in the United States Army and served in both houses of Congress. As president, Jackson sought to advance the rights of the 'common man' against a 'corrupt aristocracy' and to preserve the Union.",
    "website": "https://en.wikipedia.org/wiki/Andrew_Jackson"
  },
  {
    "id": 8,
    "full_name": "Martin Van Buren",
    "birth_year": 1782,
    "death_year": 1862,
    "took_office": "1837-03-04",
    "left_office": "1841-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_8",
    "biography": "Martin Van Buren (/væn ˈbjʊərən/ van BEWR-ən; born Maarten Van Buren, Dutch pronunciation: [ˈmaːrtə(n) vɑn ˈbyːrə(n)]; December 5, 1782 – July 24, 1862) was an American statesman who served as the eighth president of the United States from 1837 to 1841. He was the first president born after the independence of the United States from the British Empire. A founder of the Democratic Party, he previously served as the ninth governor of New York, the tenth United States secretary of state, and the eighth vice president of the United States. He won the 1836 presidential election with the endorsement of popular outgoing President Andrew Jackson and the organizational strength of the Democratic Party. He lost his 1840 reelection bid to Whig Party nominee William Henry Harrison, due in part to the poor economic conditions of the Panic of 1837. Later in his life, Van Buren emerged as an elder statesman and important anti-slavery leader, who led the Free Soil Party ticket in the 1848 presidential election.",
    "website": "https://en.wikipedia.org/wiki/Martin_Van_Buren"
  },
  {
    "id": 9,
    "full_name": "William Henry Harrison",
    "birth_year": 1773,
    "death_year": 1841,
    "took_office": "1841-03-04",
    "left_office": "1841-04-04",
    "party": "Whig",
    "image_name": "US_President_L_9",
    "biography": "William Henry Harrison (February 9, 1773 – April 4, 1841) was an American military officer and politician who served as the ninth president of the United States in 1841. He died of typhoid, pneumonia or paratyphoid fever 31 days into his term (the shortest tenure), becoming the first president to die in office. His death sparked a brief constitutional crisis regarding succession to the presidency, because the Constitution was unclear as to whether Vice President John Tyler should assume the office of president or merely execute the duties of the vacant office. Tyler claimed a constitutional mandate to become the new president and took the presidential oath of office, setting an important precedent for an orderly transfer of the presidency and its full powers when the previous president fails to complete the elected term.",
    "website": "https://en.wikipedia.org/wiki/William_Henry_Harrison"
  },
  {
    "id": 10,
    "full_name": "John Tyler",
    "birth_year": 1790,
    "death_year": 1862,
    "took_office": "1841-04-04",
    "left_office": "1845-03-04",
    "party": "Whig",
    "image_name": "US_President_L_10",
    "biography": "John Tyler (March 29, 1790 – January 18, 1862) was the tenth president of the United States from 1841 to 1845 after briefly serving as the tenth vice president (1841); he was elected to the latter office on the 1840 Whig ticket with President William Henry Harrison. Tyler ascended to the presidency after Harrison's death in April 1841, only a month after the start of the new administration. He was a stalwart supporter and advocate of states' rights, and as president he adopted nationalist policies only when they did not infringe on the powers of the states. His unexpected rise to the presidency, with the resulting threat to the presidential ambitions of Henry Clay and other politicians, left him estranged from both major political parties.",
    "website": "https://en.wikipedia.org/wiki/John_Tyler"
  },
  {
    "id": 11,
    "full_name": "James K. Polk",
    "birth_year": 1795,
    "death_year": 1849,
    "took_office": "1845-03-04",
    "left_office": "1849-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_11",
    "biography": "James Knox Polk (November 2, 1795 – June 15, 1849) was the 11th president of the United States, serving from 1845 to 1849. He previously was Speaker of the House of Representatives (1835–1839) and governor of Tennessee (1839–1841). A protégé of Andrew Jackson, he was a member of the Democratic Party and an advocate of Jacksonian democracy. Polk is chiefly known for extending the territory of the United States during the Mexican–American War; during his presidency, the United States expanded significantly with the annexation of the Republic of Texas, the Oregon Territory, and the Mexican Cession following the American victory in the Mexican–American War.",
    "website": "https://en.wikipedia.org/wiki/James_K._Polk"
  },
  {
    "id": 12,
    "full_name": "Zachary Taylor",
    "birth_year": 1784,
    "death_year": 1850,
    "took_office": "1849-03-04",
    "left_office": "1850-07-09",
    "party": "Whig",
    "image_name": "US_President_L_12",
    "biography": "Zachary Taylor (November 24, 1784 – July 9, 1850) was the 12th president of the United States, serving from March 1849 until his death in July 1850. Taylor previously was a career officer in the United States Army, rose to the rank of major general and became a national hero as a result of his victories in the Mexican–American War. As a result, he won election to the White House despite his vague political beliefs. His top priority as president was preserving the Union, but he died sixteen months into his term, before making any progress on the status of slavery, which had been inflaming tensions in Congress.",
    "website": "https://en.wikipedia.org/wiki/Zachary_Taylor"
  },
  {
    "id": 13,
    "full_name": "Millard Fillmore",
    "birth_year": 1800,
    "death_year": 1874,
    "took_office": "1850-07-09",
    "left_office": "1853-03-04",
    "party": "Whig",
    "image_name": "US_President_L_13",
    "biography": "Millard Fillmore (January 7, 1800 – March 8, 1874) was the 13th president of the United States (1850–1853), the last to be a member of the Whig Party while in the White House. A former U.S. representative from New York, Fillmore was elected the nation's 12th vice president in 1848, and succeeded to the presidency in July 1850 upon the death of President Zachary Taylor. He was instrumental in getting the Compromise of 1850 passed, a bargain that led to a brief truce in the battle over slavery. He failed to win the Whig nomination for president in 1852; he gained the endorsement of the nativist Know Nothing Party four years later, and finished third in that election.",
    "website": "https://en.wikipedia.org/wiki/Millard_Fillmore"
  },
  {
    "id": 14,
    "full_name": "Franklin Pierce",
    "birth_year": 1804,
    "death_year": 1869,
    "took_office": "1853-03-04",
    "left_office": "1857-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_14",
    "biography": "Franklin Pierce (November 23, 1804 – October 8, 1869) was the 14th president of the United States (1853–1857), a northern Democrat who saw the abolitionist movement as a fundamental threat to the unity of the nation. He alienated anti-slavery groups by championing and signing the Kansas–Nebraska Act and enforcing the Fugitive Slave Act, yet he failed to stem conflict between North and South, setting the stage for Southern secession and the American Civil War.",
    "website": "https://en.wikipedia.org/wiki/Franklin_Pierce"
  },
  {
    "id": 15,
    "full_name": "James Buchanan",
    "birth_year": 1791,
    "death_year": 1868,
    "took_office": "1857-03-04",
    "left_office": "1861-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_15",
    "biography": "James Buchanan Jr. (/bjuːˈkænən/; April 23, 1791 – June 1, 1868) was the 15th president of the United States (1857–1861), serving prior to the American Civil War. A member of the Democratic Party, he served as the United States Secretary of State and in both houses of Congress before becoming president. Born in Cove Gap, Pennsylvania, Buchanan became a prominent lawyer and won election to the Pennsylvania House of Representatives as a Federalist. In 1820, he won election to the United States House of Representatives, aligning with Andrew Jackson's Democratic Party. He served as Jackson's Minister to Russia, then won election as a senator from Pennsylvania. In 1845, he accepted appointment as President James K. Polk's Secretary of State.",
    "website": "https://en.wikipedia.org/wiki/James_Buchanan"
  },
  {
    "id": 16,
    "full_name": "Abraham Lincoln",
    "birth_year": 1809,
    "death_year": 1865,
    "took_office": "1861-03-04",
    "left_office": "1865-04-15",
    "party": "Republican",
    "image_name": "US_President_L_16",
    "biography": "Abraham Lincoln (February 12, 1809 – April 15, 1865) was an American statesman and lawyer who served as the 16th president of the United States from March 1861 until his assassination in April 1865. Lincoln led the nation through the American Civil War, its bloodiest war and its greatest moral, constitutional, and political crisis. He preserved the Union, abolished slavery, strengthened the federal government, and modernized the U.S. economy.",
    "website": "https://en.wikipedia.org/wiki/Abraham_Lincoln"
  },
  {
    "id": 17,
    "full_name": "Andrew Johnson",
    "birth_year": 1808,
    "death_year": 1875,
    "took_office": "1865-04-15",
    "left_office": "1869-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_17",
    "biography": "Andrew Johnson (December 29, 1808 – July 31, 1875) was the 17th president of the United States, serving from 1865 to 1869. Johnson assumed the presidency as he was vice president of the United States at the time of the assassination of Abraham Lincoln. A Democrat who ran with Lincoln on the National Union ticket, Johnson came to office as the Civil War concluded. He favored quick restoration of the seceded states to the Union. His plans did not give protection to the former slaves; he came into conflict with the Republican-dominated Congress, culminating in his impeachment by the House of Representatives. He was acquitted in the Senate by one vote. Johnson's main accomplishment as president is the Alaska purchase.",
    "website": "https://en.wikipedia.org/wiki/Andrew_Johnson"
  },
  {
    "id": 18,
    "full_name": "Ulysses S. Grant",
    "birth_year": 1822,
    "death_year": 1885,
    "took_office": "1869-03-04",
    "left_office": "1877-03-04",
    "party": "Republican",
    "image_name": "US_President_L_18",
    "biography": "Ulysses S. Grant (born Hiram Ulysses Grant; April 27, 1822 – July 23, 1885) was an American soldier, politician, and international statesman who served as the 18th president of the United States from 1869 to 1877. During the American Civil War, General Grant, with President Abraham Lincoln, led the Union Army to victory over the Confederacy. During the Reconstruction Era, President Grant led the Republicans in their efforts to remove the vestiges of Confederate nationalism, racism, and slavery.",
    "website": "https://en.wikipedia.org/wiki/Ulysses_S._Grant"
  },
  {
    "id": 19,
    "full_name": "Rutherford B. Hayes",
    "birth_year": 1822,
    "death_year": 1893,
    "took_office": "1877-03-04",
    "left_office": "1881-03-04",
    "party": "Republican",
    "image_name": "US_President_L_19",
    "biography": "Rutherford Birchard Hayes (October 4, 1822 – January 17, 1893) was the 19th president of the United States from 1877 to 1881, having served also as an American representative and governor of Ohio. Hayes was a lawyer and staunch abolitionist who defended refugee slaves in court proceedings in the antebellum years. He was nominated as the Republican candidate for the presidency in 1876 and elected through the Compromise of 1877 that officially ended the Reconstruction Era by leaving the South to govern itself. In office he withdrew military troops from the South, ending Army support for Republican state governments in the South and the efforts of African-American freedmen to establish their families as free citizens. He promoted civil service reform, and attempted to reconcile the divisions left over from the Civil War and Reconstruction.",
    "website": "https://en.wikipedia.org/wiki/Rutherford_B._Hayes"
  },
  {
    "id": 20,
    "full_name": "James A. Garfield",
    "birth_year": 1831,
    "death_year": 1881,
    "took_office": "1881-03-04",
    "left_office": "1881-09-19",
    "party": "Republican",
    "image_name": "US_President_L_20",
    "biography": "James Abram Garfield (November 19, 1831 – September 19, 1881) was the 20th president of the United States, serving from March 4, 1881 until his death by assassination six and a half months later. He was the first sitting member of Congress to be elected to the presidency, and remains the only sitting House member to gain the White House.",
    "website": "https://en.wikipedia.org/wiki/James_A._Garfield"
  },
  {
    "id": 21,
    "full_name": "Chester A. Arthur",
    "birth_year": 1829,
    "death_year": 1886,
    "took_office": "1881-09-19",
    "left_office": "1885-03-04",
    "party": "Republican",
    "image_name": "US_President_L_21",
    "biography": "Chester Alan Arthur (October 5, 1829 – November 18, 1886) was an American attorney and politician who served as the 21st president of the United States from 1881 to 1885. He previously was the 20th vice president of the United States, and he succeeded to the presidency upon the death of President James A. Garfield in September 1881, two months after Garfield was shot by an assassin.",
    "website": "https://en.wikipedia.org/wiki/Chester_A._Arthur"
  },
  {
    "id": 22,
    "full_name": "Grover Cleveland",
    "birth_year": 1837,
    "death_year": 1908,
    "took_office": "1885-03-04",
    "left_office": "1889-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_22",
    "biography": "Stephen Grover Cleveland (March 18, 1837 – June 24, 1908) was an American politician and lawyer who was the 22nd and 24th president of the United States, the only president in American history to serve two non-consecutive terms in office (1885–1889 and 1893–1897). He won the popular vote for three presidential elections—in 1884, 1888, and 1892—and was one of two Democrats (with Woodrow Wilson) to be elected president during the era of Republican political domination dating from 1861 to 1933.",
    "website": "https://en.wikipedia.org/wiki/Grover_Cleveland"
  },
  {
    "id": 23,
    "full_name": "Benjamin Harrison",
    "birth_year": 1833,
    "death_year": 1901,
    "took_office": "1889-03-04",
    "left_office": "1893-03-04",
    "party": "Republican",
    "image_name": "US_President_L_23",
    "biography": "Benjamin Harrison VIII was an American politician and lawyer who served as the 23rd president of the United States from 1889 to 1893. He was a grandson of the ninth president, William Henry Harrison, creating the only grandfather–grandson duo to have held the office.",
    "website": "https://en.wikipedia.org/wiki/Benjamin_Harrison"
  },
  {
    "id": 24,
    "full_name": "Grover Cleveland",
    "birth_year": 1837,
    "death_year": 1908,
    "took_office": "1893-03-04",
    "left_office": "1897-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_24",
    "biography": "Stephen Grover Cleveland (March 18, 1837 – June 24, 1908) was an American politician and lawyer who was the 22nd and 24th president of the United States, the only president in American history to serve two non-consecutive terms in office (1885–1889 and 1893–1897). He won the popular vote for three presidential elections—in 1884, 1888, and 1892—and was one of two Democrats (with Woodrow Wilson) to be elected president during the era of Republican political domination dating from 1861 to 1933.",
    "website": "https://en.wikipedia.org/wiki/Grover_Cleveland"
  },
  {
    "id": 25,
    "full_name": "William McKinley",
    "birth_year": 1843,
    "death_year": 1901,
    "took_office": "1897-03-04",
    "left_office": "1901-09-14",
    "party": "Republican",
    "image_name": "US_President_L_25",
    "biography": "William McKinley (born William McKinley Jr.; January 29, 1843 – September 14, 1901) was the 25th president of the United States, serving from March 4, 1897, until his assassination six months into his second term. During his presidency, McKinley led the nation to victory in the Spanish–American War, raised protective tariffs to promote American industry and kept the nation on the gold standard in a rejection of free silver (effectively, expansionary monetary policy).",
    "website": "https://en.wikipedia.org/wiki/William_McKinley"
  },
  {
    "id": 26,
    "full_name": "Theodore Roosevelt",
    "birth_year": 1858,
    "death_year": 1919,
    "took_office": "1901-09-14",
    "left_office": "1909-03-04",
    "party": "Republican",
    "image_name": "US_President_L_26",
    "biography": "Theodore Roosevelt Jr. (/ˈroʊzəvɛlt/ ROH-zə-velt;[b] October 27, 1858 – January 6, 1919) was an American statesman, politician, conservationist, naturalist, and writer who served as the 26th president of the United States from 1901 to 1909. He served as the 25th vice president from March to September 1901 and as the 33rd governor of New York from 1899 to 1900. As a leader of the Republican Party, he became a driving force for the Progressive Era in the United States in the early 20th century. His face is depicted on Mount Rushmore alongside George Washington, Thomas Jefferson, and Abraham Lincoln. He is generally ranked in polls of historians and political scientists as one of the five best presidents.",
    "website": "https://en.wikipedia.org/wiki/Theodore_Roosevelt"
  },
  {
    "id": 27,
    "full_name": "William Howard Taft",
    "birth_year": 1857,
    "death_year": 1930,
    "took_office": "1909-03-04",
    "left_office": "1913-03-04",
    "party": "Republican",
    "image_name": "US_President_L_27",
    "biography": "William Howard Taft (September 15, 1857 – March 8, 1930) was the 27th president of the United States (1909–1913) and the tenth chief justice of the United States (1921–1930), the only person to have held both offices. Taft was elected president in 1908, the chosen successor of Theodore Roosevelt, but was defeated for re-election by Woodrow Wilson in 1912 after Roosevelt split the Republican vote by running as a third-party candidate. In 1921, President Warren G. Harding appointed Taft to be chief justice, a position in which he served until a month before his death.",
    "website": "https://en.wikipedia.org/wiki/William_Howard_Taft"
  },
  {
    "id": 28,
    "full_name": "Woodrow Wilson",
    "birth_year": 1856,
    "death_year": 1924,
    "took_office": "1913-03-04",
    "left_office": "1921-03-04",
    "party": "Democratic",
    "image_name": "US_President_L_28",
    "biography": "Thomas Woodrow Wilson (December 28, 1856 – February 3, 1924) was an American statesman, lawyer, and academic who served as the 28th president of the United States from 1913 to 1921, and was the leading architect of the League of Nations. A member of the Democratic Party, Wilson served as the president of Princeton University and as the 34th governor of New Jersey before winning the 1912 presidential election. As president, he oversaw the passage of progressive legislative policies unparalleled until the New Deal in 1933. He also led the United States into World War I in 1917, establishing an activist foreign policy known as Wilsonianism.",
    "website": "https://en.wikipedia.org/wiki/Woodrow_Wilson"
  },
  {
    "id": 29,
    "full_name": "Warren G. Harding",
    "birth_year": 1865,
    "death_year": 1923,
    "took_office": "1921-03-04",
    "left_office": "1923-08-02",
    "party": "Republican",
    "image_name": "US_President_L_29",
    "biography": "Warren Gamaliel Harding (November 2, 1865 – August 2, 1923) was the 29th president of the United States from 1921 until his death in 1923. A member of the Republican Party, he was one of the most popular U.S. presidents to that point. After his death a number of scandals, such as Teapot Dome, came to light, as did his extramarital affair with Nan Britton; each eroded his popular regard. He is often rated as one of the worst presidents in historical rankings.",
    "website": "https://en.wikipedia.org/wiki/Warren_G._Harding"
  },
  {
    "id": 30,
    "full_name": "Calvin Coolidge",
    "birth_year": 1872,
    "death_year": 1933,
    "took_office": "1923-08-02",
    "left_office": "1929-03-04",
    "party": "Republican",
    "image_name": "US_President_L_30",
    "biography": "Calvin Coolidge (born John Calvin Coolidge Jr.; /ˈkuːlɪdʒ/; July 4, 1872 – January 5, 1933) was an American politician and lawyer who served as the 30th president of the United States from 1923 to 1929. A Republican lawyer from New England, born in Vermont, Coolidge worked his way up the ladder of Massachusetts state politics, eventually becoming governor. His response to the Boston Police Strike of 1919 thrust him into the national spotlight and gave him a reputation as a man of decisive action. The next year, he was elected vice president of the United States, and he succeeded to the presidency upon the sudden death of Warren G. Harding in 1923. Elected in his own right in 1924, he gained a reputation as a small government conservative and also as a man who said very little and had a rather dry sense of humor.",
    "website": "https://en.wikipedia.org/wiki/Calvin_Coolidge"
  },
  {
    "id": 31,
    "full_name": "Herbert Hoover",
    "birth_year": 1874,
    "death_year": 1964,
    "took_office": "1929-03-04",
    "left_office": "1933-03-04",
    "party": "Republican",
    "image_name": "US_President_L_31",
    "biography": "Herbert Clark Hoover (August 10, 1874 – October 20, 1964) was an American engineer, businessman, and politician who served as the 31st president of the United States from 1929 to 1933. A member of the Republican Party, he held office during the onset of the Great Depression. Prior to serving as president, Hoover led the Commission for Relief in Belgium, served as the director of the U.S. Food Administration, and served as the 3rd U.S. Secretary of Commerce.",
    "website": "https://en.wikipedia.org/wiki/Herbert_Hoover"
  },
  {
    "id": 32,
    "full_name": "Franklin D. Roosevelt",
    "birth_year": 1882,
    "death_year": 1945,
    "took_office": "1933-03-04",
    "left_office": "1945-04-12",
    "party": "Democratic",
    "image_name": "US_President_L_32",
    "biography": "Franklin Delano Roosevelt (/ˈroʊzəvəlt/, /-vɛlt/; January 30, 1882 – April 12, 1945), often referred to by the initials FDR, was an American statesman and political leader who served as the 32nd president of the United States from 1933 until his death in 1945. A member of the Democratic Party, he won a record four presidential elections and became a central figure in world events during the first half of the 20th century. Roosevelt directed the federal government during most of the Great Depression, implementing his New Deal domestic agenda in response to the worst economic crisis in U.S. history. As a dominant leader of his party, he built the New Deal Coalition, which realigned American politics into the Fifth Party System and defined American liberalism throughout the middle third of the 20th century. His third and fourth terms were dominated by World War II, which ended shortly after he died in office. He is rated by scholars as one of the three greatest U.S. presidents, along with George Washington and Abraham Lincoln, but has also been subject to substantial criticism.",
    "website": "https://en.wikipedia.org/wiki/Franklin_D._Roosevelt"
  },
  {
    "id": 33,
    "full_name": "Harry S. Truman",
    "birth_year": 1884,
    "death_year": 1972,
    "took_office": "1945-04-12",
    "left_office": "1953-01-20",
    "party": "Democratic",
    "image_name": "US_President_L_33",
    "biography": "Harry S. Truman (May 8, 1884 – December 26, 1972) was the 33rd president of the United States from 1945 to 1953, succeeding upon the death of Franklin D. Roosevelt after serving as vice president. He implemented the Marshall Plan to rebuild the economy of Western Europe, and established the Truman Doctrine and NATO.",
    "website": "https://en.wikipedia.org/wiki/Harry_S._Truman"
  },
  {
    "id": 34,
    "full_name": "Dwight D. Eisenhower",
    "birth_year": 1890,
    "death_year": 1969,
    "took_office": "1953-01-20",
    "left_office": "1961-01-20",
    "party": "Republican",
    "image_name": "US_President_L_34",
    "biography": "Dwight David 'Ike' Eisenhower (/ˈaɪzənhaʊ.ər/ EYE-zən-how-ər; October 14, 1890 – March 28, 1969) was an American army general and statesman who served as the 34th president of the United States from 1953 to 1961. During World War II, he was a five-star general in the Army and served as Supreme Commander of the Allied Expeditionary Force in Europe. He was responsible for planning and supervising the invasion of North Africa in Operation Torch in 1942–43 and the successful Invasion of Normandy in 1944–45 from the Western Front.",
    "website": "https://en.wikipedia.org/wiki/Dwight_D._Eisenhower"
  },
  {
    "id": 35,
    "full_name": "John F. Kennedy",
    "birth_year": 1917,
    "death_year": 1963,
    "took_office": "1961-01-20",
    "left_office": "1963-11-22",
    "party": "Democratic",
    "image_name": "US_President_L_35",
    "biography": "John Fitzgerald Kennedy (May 29, 1917 – November 22, 1963), often referred to by initials JFK and Jack, was an American politician who served as the 35th president of the United States from January 1961 until his assassination in November 1963. Kennedy served at the height of the Cold War, and the majority of his work as president dealt with managing relations with the Soviet Union and Cuba. A Democrat, Kennedy represented Massachusetts in the U.S. House of Representatives and Senate prior to becoming president.",
    "website": "https://en.wikipedia.org/wiki/John_F._Kennedy"
  },
  {
    "id": 36,
    "full_name": "Lyndon B. Johnson",
    "birth_year": 1908,
    "death_year": 1973,
    "took_office": "1963-11-22",
    "left_office": "1969-01-20",
    "party": "Democratic",
    "image_name": "US_President_L_36",
    "biography": "Lyndon Baines Johnson (/ˈlɪndən ˈbeɪnz/; August 27, 1908 – January 22, 1973), often referred to as LBJ, was an American politician who served as the 36th president of the United States from 1963 to 1969. Formerly the 37th vice president from 1961 to 1963, he assumed the presidency following the assassination of President John F. Kennedy. A Democrat from Texas, Johnson also served as a United States Representative and as the Majority Leader in the United States Senate. Johnson is one of only four people who have served in all four federal elected positions.",
    "website": "https://en.wikipedia.org/wiki/Lyndon_B._Johnson"
  },
  {
    "id": 37,
    "full_name": "Richard Nixon",
    "birth_year": 1913,
    "death_year": 1994,
    "took_office": "1969-01-20",
    "left_office": "1974-08-09",
    "party": "Republican",
    "image_name": "US_President_L_37",
    "biography": "Richard Milhous Nixon (January 9, 1913 – April 22, 1994) was an American politician who served as the 37th president of the United States from 1969 until his resignation in 1974. The only president to resign from the office, he previously served as the nation's 36th vice president from 1953 to 1961, and as a representative and senator from California.",
    "website": "https://en.wikipedia.org/wiki/Richard_Nixon"
  },
  {
    "id": 38,
    "full_name": "Gerald Ford",
    "birth_year": 1913,
    "death_year": 2006,
    "took_office": "1974-08-09",
    "left_office": "1977-01-20",
    "party": "Republican",
    "image_name": "US_President_L_38",
    "biography": "Gerald Rudolph Ford Jr. (born Leslie Lynch King Jr.; July 14, 1913 – December 26, 2006) was an American politician who served as the 38th president of the United States from August 1974 to January 1977. Before his accession to the presidency, Ford served as the 40th vice president of the United States from December 1973 to August 1974. Ford is the only person to have served as both vice president and president without being elected to either office by the Electoral College.",
    "website": "https://en.wikipedia.org/wiki/Gerald_Ford"
  },
  {
    "id": 39,
    "full_name": "Jimmy Carter",
    "birth_year": 1924,
    "death_year": null,
    "took_office": "1977-01-20",
    "left_office": "1981-01-20",
    "party": "Democratic",
    "image_name": "US_President_L_39",
    "biography": "James Earl Carter Jr. (born October 1, 1924) is an American politician and philanthropist who served as the 39th president of the United States from 1977 to 1981. A member of the Democratic Party, he previously served as a Georgia State Senator from 1963 to 1967 and as the 76th Governor of Georgia from 1971 to 1975. Since leaving the presidency, Carter has remained active in the private sector; in 2002, he was awarded the Nobel Peace Prize for his work in co-founding the Carter Center.",
    "website": "https://en.wikipedia.org/wiki/Jimmy_Carter"
  },
  {
    "id": 40,
    "full_name": "Ronald Reagan",
    "birth_year": 1911,
    "death_year": 2004,
    "took_office": "1981-01-20",
    "left_office": "1989-01-20",
    "party": "Republican",
    "image_name": "US_President_L_40",
    "biography": "Ronald Wilson Reagan (/ˈreɪɡən/; February 6, 1911 – June 5, 2004) was an American politician who served as the 40th president of the United States from 1981 to 1989 and became the highly influential voice of modern conservatism. Prior to his presidency, he was a Hollywood actor and union leader before serving as the 33rd governor of California from 1967 to 1975.",
    "website": "https://en.wikipedia.org/wiki/Ronald_Reagan"
  },
  {
    "id": 41,
    "full_name": "George H. W. Bush",
    "birth_year": 1924,
    "death_year": 2018,
    "took_office": "1989-01-20",
    "left_office": "1993-01-20",
    "party": "Republican",
    "image_name": "US_President_L_41",
    "biography": "George Herbert Walker Bush (June 12, 1924 – November 30, 2018) was an American politician and businessman who served as the 41st president of the United States from 1989 to 1993 and the 43rd vice president from 1981 to 1989. A member of the Republican Party, Bush also served in the U.S. House of Representatives, as U.S. Ambassador to the United Nations, and as Director of Central Intelligence. Later in life, he was known publicly as George H. W. Bush to distinguish him from his eldest son George W. Bush, who served as the nation's 43rd president from 2001 to 2009.",
    "website": "https://en.wikipedia.org/wiki/George_H._W._Bush"
  },
  {
    "id": 42,
    "full_name": "Bill Clinton",
    "birth_year": 1946,
    "death_year": null,
    "took_office": "1993-01-20",
    "left_office": "2001-01-20",
    "party": "Democratic",
    "image_name": "US_President_L_42",
    "biography": "William Jefferson Clinton (born William Jefferson Blythe III; August 19, 1946) is an American politician who served as the 42nd president of the United States from 1993 to 2001. Prior to the presidency, he was the governor of Arkansas from 1979 to 1981, and again from 1983 to 1992, and the attorney general of Arkansas from 1977 to 1979. A member of the Democratic Party, Clinton was ideologically a New Democrat, and many of his policies reflected a centrist 'Third Way' political philosophy.",
    "website": "https://en.wikipedia.org/wiki/Bill_Clinton"
  },
  {
    "id": 43,
    "full_name": "George W. Bush",
    "birth_year": 1946,
    "death_year": null,
    "took_office": "2001-01-20",
    "left_office": "2009-01-20",
    "party": "Republican",
    "image_name": "US_President_L_43",
    "biography": "George Walker Bush (born July 6, 1946) is an American politician and businessman who served as the 43rd president of the United States from 2001 to 2009. He had previously served as the 46th governor of Texas from 1995 to 2000. Bush is the eldest son of Barbara and George H. W. Bush, the 41st president of the United States, and is the second president to so follow in his father's footsteps, the first being John Quincy Adams. After graduating from Yale University in 1968 and Harvard Business School in 1975, he worked in the oil industry.",
    "website": "https://en.wikipedia.org/wiki/George_W._Bush"
  },
  {
    "id": 44,
    "full_name": "Barack Obama",
    "birth_year": 1961,
    "death_year": null,
    "took_office": "2009-01-20",
    "left_office": "2017-01-20",
    "party": "Democratic",
    "image_name": "US_President_L_44",
    "biography": "Barack Hussein Obama II (/bəˈrɑːk huːˈseɪn oʊˈbɑːmə/ (About this soundlisten);[1] born August 4, 1961) is an American attorney and politician who served as the 44th president of the United States from 2009 to 2017. A member of the Democratic Party, he was the first African American to be elected to the presidency. He previously served as a U.S. senator from Illinois from 2005 to 2008 and an Illinois state senator from 1997 to 2004.",
    "website": "https://en.wikipedia.org/wiki/Barack_Obama"
  },
  {
    "id": 45,
    "full_name": "Donald J. Trump",
    "birth_year": 1946,
    "death_year": null,
    "took_office": "2017-01-20",
    "left_office": null,
    "party": "Republican",
    "image_name": "US_President_L_45",
    "biography": "Trump was born and raised in the New York City borough of Queens, and received a B.S. degree in economics from the Wharton School at the University of Pennsylvania. He took charge of his family's real-estate business in 1971, renamed it The Trump Organization, and expanded its operations from Queens and Brooklyn into Manhattan. The company built or renovated skyscrapers, hotels, casinos, and golf courses. Trump later started various side ventures, mostly by licensing his name. He co-authored several books, including The Art of the Deal. He owned the Miss Universe and Miss USA beauty pageants from 1996 to 2015, and produced and hosted The Apprentice, a reality television show, from 2003 to 2015. Forbes estimates his net worth to be $3.1 billion.",
    "website": "https://en.wikipedia.org/wiki/Donald_Trump"
  }
]

